[
  {
    "quickview-portrait-image src": "https://evertaletoolbox2.runasp.net/files/images/monsters/small/FreyaNewBoss03_2.png",
    "Name": "Mega Freya",
    "icon36 src (2)": "https://evertaletoolbox2.runasp.net/files/ui/elements/Fire.png",
    "ATK": "3,000",
    "HP": "178,000",
    "SPD": "512",
    "icon36 src (3)": "https://evertaletoolbox2.runasp.net/files/ui/weapons/Spear.png",
    "Active Skill 1": "Loving Cleave",
    "skill-description": "250% damage to 1 enemy, plus 150% for each time this skill has already been used while on the battlefield (max of 1000% total damage). The user will immediately get the next turn if this is the first time this skill has been used while on the battlefield or if this unit has used Meteor Call or Waves of War since this skill was last used.\n\nThen grant all allies the Burn status effect. This will overwrite other status effects on those units. Any unit that deals damage to or is dealt damage by a unit with burn will also become burned.",
    "Active Skill 2": "Meteor Call",
    "skill-description (2)": "400% damage to 2 enemies. Every second time this skill is activated while on the battlefield, this skill will randomly deal either 800% or 1000% damage instead. This attack ignores the Counter Stance Status Effect and the effects of Skin passive skills.\n\nUsable if the user has the Burn status effect.",
    "Active Skill 3": "Rampant Blaze",
    "skill-description (3)": "Grants all enemies the Burn status effect. The user is granted Burn, and a Burn Shield.\n\nThen all burning enemies on the battlefield are Stunned for 50TU.\n\nThis skill becomes locked for 50TU after use. Burn Shields prevent the next non-burn status effect a unit would gain while Burning from applying.",
    "Active Skill 4": "Waves of War",
    "skill-description (4)": "1000% damage to 1 enemy.\n\nThen immediately give all other allies that are burning the next turns by reducing their current TU. Active skills that grant turns cannot be used by any affected units until after they have had the turn.\n\nLocked for 100TU after the user has entered the battlefield, and locks again for 100TU after each use. Usable 3 times per battle.",
    "Passive Skill 1": "Beauty and War",
    "skill-description (5)": "This unit enters battle with Mega Healing Burn for 100TU.\n\nThis unit cannot be defeated by damage from Burn status effects, and cannot be sent to the reinforcements from the battlefield.\n\nThis unit's attacks ignore any effects of non-boss enemies that would prevent their targets from being defeated.\n\nWhen this unit takes damage from an attack, they will immediately get the next turn, this cannot trigger again until TU advances. This is a Skin effect.\n\nThis unit becomes Enraged at the end of its turns if this unit is Burning. This will overwrite the effects of other Enrage skills on this unit. Enraged units have their Attack increased to 1.5x until the end of their next turn.\n\nWhenever another enemy unit enters the battlefield from reinforcements this unit will have its TU reduced to 0.\n\nA unit with Mega Healing Burn will heal after each turn at 20 times the rate as Healing Burn. Mega Healing Burn will overwrite other status effects including Healing Burn, cannot be overwritten by Burn, Poison or Sleep status effects, and cannot be Purified. Any unit that deals damage to or is dealt damage by a unit with Mega Healing Burn will gain the Burn status effect. A unit with Mega Healing Burn will be granted Healing Burn for 300TU when Mega Healing Burn expires.",
    "Passive Skill 2": "Yggdrasil's Favor",
    "skill-description (6)": "If this unit would be defeated by an enemy attack or a status effect while having more than 1 HP, it instead survives with 1 HP.\n\nThis unit has Stun immunity.\n\nThis unit has 50% damage reduction.\n\nThe first time damage from one of this unit's attacks defeats a non-conjured enemy, another random non-boss, non-Ephemeral enemy on the battlefield will be immediately defeated (the user is considered to have defeated that enemy with an attack). This effect ignores Revenge passive skills, Revival passive skills, and any passive skills or effects of active skills that would prevent the random enemy from being defeated.This effect is reset so it can trigger again whenever a non-conjured ally on the battlefield is defeated while this unit is on the battlefield."
  },
  {
    "quickview-portrait-image src": "https://evertaletoolbox2.runasp.net/files/images/monsters/small/FreyaNewBoss01_2.png",
    "Name": "Berserk Freya",
    "icon36 src (2)": "https://evertaletoolbox2.runasp.net/files/ui/elements/Fire.png",
    "ATK": "1,400",
    "HP": "20,100",
    "SPD": "512",
    "icon36 src (3)": "https://evertaletoolbox2.runasp.net/files/ui/weapons/Spear.png",
    "Active Skill 1": "Loving Cleave",
    "Active Skill 2": "Meteor Call",
    "Active Skill 3": "Rampant Blaze",
    "Active Skill 4": "Waves of War",
    "Passive Skill 1": "Beauty and War"
  },
  {
    "quickview-portrait-image src": "https://evertaletoolbox2.runasp.net/files/images/monsters/small/CalKouhaiRegularBoss03_2.png",
    "Name": "Mega Ruvi",
    "icon36 src (2)": "https://evertaletoolbox2.runasp.net/files/ui/elements/Fire.png",
    "ATK": "3,500",
    "HP": "178,000",
    "SPD": "423",
    "icon36 src (3)": "https://evertaletoolbox2.runasp.net/files/ui/weapons/Axe.png",
    "Active Skill 1": "Fire Prism",
    "skill-description": "300% damage to 1 enemy. 500% damage instead if the user is burning. This attack ignores any effects of non-boss enemies that would prevent the target from being defeated.\n\nThe user is then granted the Burn status effect. This will overwrite other status effects on the user. Allies gain Spirit equal to the number of burning enemies on the battlefield after this attack. Any unit that deals damage to or is dealt damage by a unit with burn will also become burned.",
    "Active Skill 2": "Infectious Ignition",
    "skill-description (2)": "Enrages all burning allies. This will overwrite the effects of other Enrage skills on those units. Enraged units have their Attack increased to 1.5x until the end of their next turn.\n\nThen 1 random ally and 1 random enemy are granted the Burn status effect and become infected with it.\n\nUsable only if the user has stored 3 Charges. Consumes all Charges on the user.\n\nAfter the end of each turn, this infection will trigger to apply Burn to a random non-burning unit on the infected unit's team. Each infection ends after 3 triggers (even if they find no valid target) or once the infected unit is defeated or leaves the battlefield. Infection is not a status effect and cannot be prevented or purified, but the status effect spread by the infection may be. A unit cannot get a new infection until their existing one ends.",
    "Active Skill 3": "Combo Scorch",
    "skill-description (3)": "400% damage to 1 enemy. 600% damage instead if all allies on the battlefield are burning. This attack ignores any effects of non-boss enemies that would prevent the target from being defeated.\n\nUnlocked each time the user damages an enemy with another attack. This skill is locked again after each use or if the user leaves the battlefield.",
    "Active Skill 4": "Dual Destruction",
    "skill-description (4)": "700% damage to 2 enemies. This attack ignores any effects of non-boss enemies that would prevent the target from being defeated.\n\nUsable only if 2 or more units on the same team are burning. If this skill is used 3 times within 10TU, it becomes locked for 50TU.",
    "Passive Skill 1": "Scorching Presence",
    "skill-description (5)": "This unit cannot be defeated by damage from Burn status effects.\n\nThis unit cannot be Stunned if any ally on the battlefield is burning.\n\nWhile all enemies on the battlefield are burning, this unit has 0.5x of their original Attack added to their Attack. This does stack on top of Enrage effects, and other Attack increases (e.g. 1.5x + 0.5x => 2.0x total)\n\nAt the end of each of this unit's turns, all burning enemies on the battlefield will be stunned for 25TU.\n\nEach time this unit damages a burning enemy with an attack, a random burning ally will have their TU reduced to 0 at the end of the turn. This cannot trigger unless there are 2 burning allies on the battlefield.\n\nEach time an ally unit damages an enemy with an attack, this unit will gain a Charge. If that enemy was burning, a random ally will be granted Piercing. A unit with Piercing will have their Attacks ignore enemy damage reduction effects until the end of their next turn. Certain skills are affected by and may consume charges. A unit can store up to 3 charges and all charges are removed from a unit that leaves the battlefield.",
    "Passive Skill 2": "Everburning Devotion",
    "skill-description (6)": "If this unit would be defeated by an enemy attack or a status effect while having more than 1 HP, it instead survives with 1 HP.\n\nThis unit cannot be sent to the reinforcements from the battlefield.\n\nThis unit has 80% damage reduction from attacks. This reduction is lowered by 10% for each time this unit is hit by an enemy attack while on the battlefield (to a minimum of 30% after being hit by 5 enemy attacks).\n\nBurns all allies on the battlefield when this unit is defeated by an enemy, this will overwrite other status effects on those units.\n\nWhen this unit enters the battlefield, this unit is granted Mega Healing Burn for 100TU, and all allies that are either Fire element or have a Burn Blast or Burn Drive type active skill will have the TU costs for all of their skills reduced by 20%. This will overwrite the effects of other Quicken skills. Whenever another ally that is either Fire element or has a Burn Blast or Burn Drive type active skill enters the battlefield from reinforcements, they will have the TU costs for all of their skills reduced by 20%.\n\nA unit with Mega Healing Burn will heal after each turn at 20 times the rate as Healing Burn. This will overwrite other status effects including Healing Burn on this unit, cannot be overwritten by Burn, Poison or Sleep status effects, and cannot be Purified. Any unit that deals damage to or is dealt damage by a unit with Mega Healing Burn will gain the Burn status effect. A unit with Mega Healing Burn will be granted Healing Burn for 300TU when Mega Healing Burn expires."
  },
  {
    "quickview-portrait-image src": "https://evertaletoolbox2.runasp.net/files/images/monsters/small/CalKouhaiRegularBoss01_2.png",
    "Name": "Berserk Ruvi",
    "icon36 src (2)": "https://evertaletoolbox2.runasp.net/files/ui/elements/Fire.png",
    "ATK": "1,400",
    "HP": "20,100",
    "SPD": "423",
    "icon36 src (3)": "https://evertaletoolbox2.runasp.net/files/ui/weapons/Axe.png",
    "Active Skill 1": "Fire Prism",
    "Active Skill 2": "Infectious Ignition",
    "Active Skill 3": "Combo Scorch",
    "Active Skill 4": "Scorching Presence",
    "Passive Skill 1": "Everburning Devotion"
  },
  {
    "quickview-portrait-image src": "https://evertaletoolbox2.runasp.net/files/images/monsters/small/ThorRegularBoss03_2.png",
    "Name": "Mega Thor",
    "icon36 src (2)": "https://evertaletoolbox2.runasp.net/files/ui/elements/Storm.png",
    "ATK": "2,900",
    "HP": "232,000",
    "SPD": "353",
    "icon36 src (3)": "https://evertaletoolbox2.runasp.net/files/ui/weapons/Mace.png",
    "Active Skill 1": "Hammering Blade",
    "Active Skill 2": "Stunning Bolts",
    "Active Skill 3": "Disabling Bolts",
    "Active Skill 4": "Thundering Wrath",
    "Passive Skill 1": "Lord of Thunder",
    "Passive Skill 2": "Reckless Power"
  },
  {
    "quickview-portrait-image src": "https://evertaletoolbox2.runasp.net/files/images/monsters/small/ThorRegularBoss01_2.png",
    "Name": "Berserk Thor",
    "icon36 src (2)": "https://evertaletoolbox2.runasp.net/files/ui/elements/Storm.png",
    "ATK": "1,257",
    "HP": "20,000",
    "SPD": "353",
    "icon36 src (3)": "https://evertaletoolbox2.runasp.net/files/ui/weapons/Mace.png",
    "Active Skill 1": "Hammering Blade",
    "Active Skill 2": "Stunning Bolts",
    "Active Skill 3": "Disabling Bolts",
    "Active Skill 4": "Thundering Wrath",
    "Passive Skill 1": "Lord of Thunder"
  },