{
  "id": "master-of-rashomon-gate",
  "name": "Kenshin",
  "title": "Master of Rashomon Gate",
  "category": "Character",
  "element": "Dark",
  "rarity": "SSR",
  "stars": 6,
  "atk": 1254,
  "hp": 8150,
  "spd": 506,
  "cost": null,
  "weaponType": "Katana",
  "image": "https://ik.imagekit.io/r8fsa98s9/characters/KenshinRegular01.png",
  "imagesLarge": [
    "https://ik.imagekit.io/r8fsa98s9/characters/KenshinRegular01.png",
    "https://ik.imagekit.io/r8fsa98s9/characters/KenshinRegular02.png",
    "https://ik.imagekit.io/r8fsa98s9/characters/KenshinRegular03.png"
  ],
  "url": "",
  "leaderSkill": {
    "name": "Dark ATK & HP Up",
    "description": "Allied Dark element units have their Attack increased by 10% and max HP increased by 7%."
  },
  "activeSkills": [
    {
      "name": "Unstable Blades",
      "tu": 30,
      "sp": 2,
      "description": "1000% damage to 1 enemy. If the target is poisoned, this unit will get another turn after the attack. (Note: This skill scales strongly with poisoned enemies.)"
    },
    {
      "name": "Poison Waves",
      "tu": 1,
      "sp": 5,
      "description": "Removes all Poison Wards from all enemy units on the battlefield, and steals up to 5 Spirit from the enemy team. Then 1 random non-burning enemy is granted Lethal Poison for 999TU. Then 1 random non-poisoned enemy is granted Mega Poison for 200TU. Then 1 random non-poisoned enemy is granted Super Poison. Then 1 random non-poisoned enemy is granted Poison. This skill cannot be used again until 1 enemy turn has passed. If this skill is used 3 times within 10TU, this skill becomes locked for 50TU. Mega Poison, Super Poison, and Poison will overwrite other status effects on those enemies. Mega Poison deals 20 times the damage of normal Poison and cannot be overwritten by normal Poison or Super Poison. Super Poison deals 4 times the damage of normal poison, and cannot be overwritten by normal poison."
    },
    {
      "name": "Toxic Burst",
      "tu": 75,
      "sp": -3,
      "description": "1000% damage to 2 enemies. Minus 100% damage for each Spirit the enemy team has (max of -500% if the enemy team has 5+ Spirit). This attack ignores damage reduction effects, skin passive skills and the Counter Stance status effect. Then the targets hit have burn removed (including Mega Healing Burn). Then grants all hit Mega Poisoned enemies Lethal Poison for 999TU. Then grants Mega Poison for 200TU to all other enemies that were hit. Lethal Poison will overwrite other status effects on the affected enemy, cannot be overwritten by status effects other than Burn or Stealth, and cannot be Purified. Lethal Poison deals 2 times the damage of normal Poison and ignores passive skills or effects of active skills that would prevent the target from being defeated, other than those which specifically prevent defeat from Poison or non-attack damage. Lethal Poison cannot apply to Burning units or Boss units."
    },
    {
      "name": "Rashomon",
      "tu": 4,
      "sp": -10,
      "description": "All non-boss, non-ephemeral enemies on the battlefield have a 50% chance each of being immediately defeated. This effect ignores Revenge passive skills, Revival passive skills, and any passive skills or effects of active skills that would prevent the target from being defeated. The user is considered to have defeated with attacks as many units as are defeated by this effect. After this skill is used, when the user is defeated by damage from an attack, a copy of the user is added to next in line of ally reinforcements with full health, and will then be considered a conjured unit. Unlocked after 5 or more non-conjured units on the battlefield are defeated or sacrificed by any source while this unit is on the battlefield. Usable once per battle."
    }
  ],
  "passiveSkills": [
    "Hypnotic Swordsman",
    "Gatekeeper",
    "HP Up Lv3",
    "Attack Up Lv3",
    "G.axe Hunter Lv3",
    "Greatsword Mastery"
  ],
  "passiveSkillDetails": [
    {
      "name": "Hypnotic Swordsman",
      "description": "This unit cannot be sent to the reinforcements from the battlefield. Each time this unit damages a poisoned enemy with an attack, this unit will be healed for 100% of its max HP. If this unit damages at least one poisoned enemy with an attack, this unit will get another turn. Damaged targets cannot trigger this effect again until TU advances. Effects that influence TU order may interrupt the extra turn (e.g. Stuns targeting the lowest TU target). The first time this unit is damaged by an attack while no enemies on the battlefield are Hypnotized, and no other \\\"Kenshin, Master of Rashomon Gate\\\" is on the battlefield, there is a 20% chance, plus 20% chance per Awakening (up to 100% chance if this unit has 4 Awakenings) for this unit to Hypnotize all enemies on the battlefield. A Hypnotized enemy will use its next turn to grant the turn to and Purify the hypnotizer (the turn will be lost as if it were sleeping), and then that unit's hypnosis will end. Hypnosis is not a status effect and cannot be removed by Purify skills, but will be canceled if the hypnotizer is defeated or leaves the battlefield. Hypnosis will fail against Boss units."
    },
    {
      "name": "Gatekeeper",
      "description": "This unit enters battle with Super Stealth, and a Stealth Shield. This unit cannot be defeated by damage from Poison status effects. While there is a poisoned enemy on the battlefield, this unit has Stun Immunity and Burn Immunity. Whenever a unit (ally or enemy) enters the battlefield from reinforcements, this unit will be healed for 100% of max HP and Purified (negative status effects like sleep, burn or poison are removed). If this unit would be defeated, it instead survives with 1 HP, then until its next turn:\\n- this unit cannot be defeated.\\n- this unit heals for 10% of max HP at the end of every turn.\\nThis is a Hold Ground+ effect, and ends after triggering once each time this unit enters the battlefield. Whenever this unit defeats an enemy with an attack or Rashomon, this Hold Ground+ effect is reset so it can trigger."
    },
    {
      "name": "HP Up Lv3",
      "description": "Adds 1200 to this unit's max HP."
    },
    {
      "name": "Attack Up Lv3",
      "description": "Adds 300 to this unit's Attack."
    },
    {
      "name": "G.axe Hunter Lv3",
      "description": "10% bonus to attacks against units equipped with Greataxes."
    },
    {
      "name": "Greatsword Mastery",
      "description": "Can use weapon skills of Greatswords in addition to their original preferred weapon type."
    }
  ],
  "derivedTags": [
    "elem_dark",
    "element_dark",
    "role_dps",
    "role_control",
    "role_sustain",
    "poison_apply",
    "poison_payoff",
    "poison_ward_break",
    "burn_cleanse",
    "spirit_steal",
    "stealth",
    "super_stealth",
    "stealth_shield",
    "purify",
    "stun_immunity",
    "burn_immunity",
    "hold_ground"
  ],
  "tagEvidence": {
    "poison_apply": [
      "Poison Waves: applies Poison/Super Poison/Mega Poison/Lethal Poison to enemies"
    ],
    "poison_payoff": [
      "Hypnotic Swordsman: heals + extra turn when damaging poisoned enemies",
      "Unstable Blades: extra turn condition on poisoned target",
      "Toxic Burst: upgrades Mega Poisoned enemies into Lethal Poison"
    ],
    "poison_ward_break": [
      "Poison Waves: removes all Poison Wards from enemies"
    ],
    "burn_cleanse": [
      "Toxic Burst: removes burn from targets hit"
    ],
    "spirit_steal": [
      "Poison Waves: steals up to 5 Spirit from enemy team"
    ],
    "stealth": [
      "Gatekeeper: enters with Super Stealth and Stealth Shield"
    ],
    "purify": [
      "Gatekeeper: self-purifies when units enter from reinforcements"
    ],
    "stun_immunity": [
      "Gatekeeper: stun immunity while a poisoned enemy exists"
    ],
    "burn_immunity": [
      "Gatekeeper: burn immunity while a poisoned enemy exists"
    ],
    "hold_ground": [
      "Gatekeeper: Hold Ground+ style survival and reset on kills"
    ]
  }
}